haskell/Parsec_parser_combinators.org
#+TITLE: Parsec - Parser Combinators 
#+DESCRIPTION: Parsec parser combinators 

* Parsec - Parser Combinators 
** Overview 
   :PROPERTIES:
   :ID:       884b9aaa-aa75-433e-b9f9-9424db4dd588
   :END:
*** Parsec 

Parsec is parser combinator library that provides parser building
blocks such as primitive parsers, parser operators and higher order
functions to build complex parsers out of simple parsers. Parsec can
be see as an EDSL - Embedded Domain Specific Language to build
parsers.


Haskell Parser libraries:

 - [[https://hackage.haskell.org/package/parsec][Parsec]] - Parser combinator library for human readable texts.

 - [[https://hackage.haskell.org/package/attoparsec][Attoparsec]] - Parser combinator library for binary formats and
   binary files.

*** Package Documentation

   - [[https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec.html][Text.Parsec]]

   - [[https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec-Combinator.html][Text.Parsec.Combinator]]

   - [[https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec-Char.html][Text.Parsec.Char]]

   - [[https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-ParserCombinators-Parsec-Prim.html][Text.ParserCombinators.Parsec.Prim]]

   - [[https://www.stackage.org/package/parsec][parsec - Stackage Server]]

