haskell/Parsec_parser_combinators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Parsec - Parser Combinators</title>
<!-- 2018-05-07 Mon 10:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues Soares Silva" />
<meta  name="description" content="Parsec parser combinators"
 />
</head>
<body>
<div id="content">
<h1 class="title">Parsec - Parser Combinators</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Parsec - Parser Combinators</a>
<ul>
<li><a href="#sec-1-1">1.1. Overview</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Parsec</a></li>
<li><a href="#sec-1-1-2">1.1.2. Package Documentation</a></li>
<li><a href="#sec-1-1-3">1.1.3. Loader Script</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Parser Combinators</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Primitive Parsers</a></li>
<li><a href="#sec-1-2-2">1.2.2. Combinators</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Examples - Complete Parsers</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Parsing numbers</a></li>
<li><a href="#sec-1-3-2">1.3.2. Simple Calculator</a></li>
<li><a href="#sec-1-3-3">1.3.3. S-expression serialization</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. References and Bookmarks</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Parsec - Parser Combinators</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><a id="ID-884b9aaa-aa75-433e-b9f9-9424db4dd588" name="ID-884b9aaa-aa75-433e-b9f9-9424db4dd588"></a><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Parsec</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Parsec is parser combinator library that provides parser building
blocks such as primitive parsers, parser operators and higher order
functions to build complex parsers out of simple parsers. Parsec can
be see as an EDSL - Embedded Domain Specific Language to build
parsers.
</p>


<p>
Haskell Parser libraries:
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/parsec">Parsec</a> - Parser combinator library for human readable texts.
</li>

<li><a href="https://hackage.haskell.org/package/attoparsec">Attoparsec</a> - Parser combinator library for binary formats and
binary files.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Package Documentation</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec.html">Text.Parsec</a>
</li>

<li><a href="https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec-Combinator.html">Text.Parsec.Combinator</a>
</li>

<li><a href="https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-Parsec-Char.html">Text.Parsec.Char</a>
</li>

<li><a href="https://hackage.haskell.org/package/parsec-3.1.11/docs/Text-ParserCombinators-Parsec-Prim.html">Text.ParserCombinators.Parsec.Prim</a>
</li>

<li><a href="https://www.stackage.org/package/parsec">parsec - Stackage Server</a>
</li>
</ul>
</div>
</div>
