haskell/Parsec_parser_combinators.org
*** Loader Script
    :PROPERTIES:
    :ID:       d377b6bc-e443-4723-8cec-12d2efb973f8
    :END:

This section will assume that the script _parsecHelpers.hs_ was loaded
with:

#+BEGIN_SRC haskell
> :script /tmp/parsecHelpers.hs 
apply :: Parser a -> String -> Either P.ParseError a
run :: Show a => Parser a -> String -> IO ()
... 
> 
#+END_SRC

*File:* _parsecHelpers.hs_

#+BEGIN_SRC haskell :tangle /tmp/parsecHelpers.hs
  import Text.Parsec.String (Parser)
  import Text.Parsec ((<|>))
  import qualified Text.Parsec as P
  import qualified Text.Parsec.Char as PC

  import Control.Monad (void)

  import Data.Either (isRight, isLeft)
      
  import Test.HUnit     
      
  :set -XFlexibleContexts

  :{
  apply :: Parser a -> String -> Either P.ParseError a
  apply p s =  P.parse p "" s
  :}

  :{
  applyOpt :: Parser a -> String -> Maybe a
  applyOpt p s = case P.parse p "" s of
                 Left _  -> Nothing
                 Right a -> Just a
  :}                 

   
  :{
  run :: Show a => Parser a -> String -> IO ()
  run p str =
      case P.parse p "" str of
        Left err  -> do putStrLn "Parser Error"
                        print err
        Right res -> print res
  :} 

  -- Parse single letter char
  :{
  pLetter :: Parser Char
  pLetter = P.letter 
  :}

  -- Parse single char
  :{ 
  pChar :: Char -> Parser Char
  pChar x = P.char x
  :}

  -- Parse single digit char
  :{
  pDigit :: Parser Char
  pDigit = P.digit
  :}

  -- Parse string 
  :{
  pStr :: String -> Parser String
  pStr str = P.string str 
  :}

  -- Parse letter surrounded by parenthesis.
   
  :{
  pParenLetter :: Parser Char
  pParenLetter = do
    P.char '('     -- Consume input '(' and discard result 
    s <- P.letter  -- Consume the letter input and save it to s.
    P.char ')'     -- Consume input ')' and discard result
    return s       -- Set parser result to s 
  :}  

  :{
  pParenLetter2 :: Parser Char
  pParenLetter2 = 
    P.char '(' >>= \_ ->     
    P.letter   >>= \s -> 
    P.char ')' >>= \_ ->    
    return s       
  :}  


  :{
  pParenLetter3 :: Parser Char
  pParenLetter3 = 
    P.char '(' >>
    P.letter   >>= \s -> 
    P.char ')' >>
    return s       
  :}  

  --- Parser Choice
  :{
  pChoice1 :: Parser String
  pChoice1 = P.string "hello world"
         <|> P.try (P.string "world")
         <|> P.try (P.string "Haskell")
         <|> P.try (P.string "ocaml")
  :}

   
  :{
  pIdentifier1 :: Parser String
  pIdentifier1 = do
    x  <- P.letter
    xs <- P.many (P.letter <|> P.try P.digit)
    return $ x:xs
  :}
     

  :{
  pNumStr :: Parser String
  pNumStr = P.many1 P.digit
  :}          

  :{
  pNum1 :: Parser Int
  pNum1 = do
    s <- P.many1 P.digit
    return $ read s   
  :}   


  :{
  pNum2 :: Parser Int
  pNum2 = fmap read $ P.many1 P.digit
       -- read <$> P.many P.digit
  :}         

   
  :{
  pTrue :: Parser Bool
  pTrue = P.string "true" >> return True
  :}

  :{
  pFalse :: Parser Bool
  pFalse = P.string "false" >> return False
  :}


  :{ 
  pCsvRow1 :: Parser [Int]
  pCsvRow1 = P.sepBy pCell (pChar ',')
      where
        pCell = do
          P.spaces
          num <- pNum1
          P.spaces
          return num

  :}    
#+END_SRC

*Running parsers*

This parser recognizes a single letter ('a' to 'z'). When it suceeds
it returns a letter. 

#+BEGIN_SRC haskell
:{
pLetter :: Parser Char
pLetter = P.letter 
:}

#+END_SRC

The function _apply_ applies a parser to an input string returning the
parser result (Result) or failure (Left).

#+BEGIN_SRC haskell
apply :: Parser a -> String -> Either P.ParseError a
#+END_SRC

#+BEGIN_SRC haskell

> apply pLetter "1"
Left (line 1, column 1):
unexpected "1"
expecting letter
it :: Either P.ParseError Char

> apply pLetter ""
Left (line 1, column 1):
unexpected end of input
expecting letter
it :: Either P.ParseError Char
> 

> apply pLetter "2323"
Left (line 1, column 1):
unexpected "2"
expecting letter
it :: Either P.ParseError Char


> run pLetter "a"
'a'
it :: ()

#+END_SRC

The function run applies a parser to an input string and prints the
the result. 

#+BEGIN_SRC haskell
run :: Show a => Parser a -> String -> IO ()
#+END_SRC

#+BEGIN_SRC haskell

> run pLetter "aa"
'a'
it :: ()
> run pLetter "1aa"
Parser Error
(line 1, column 1):
unexpected "1"
expecting letter
it :: ()

> run pLetter " aa"
Parser Error
(line 1, column 1):
unexpected " "
expecting letter
it :: ()
> 

#+END_SRC

