haskell/Parsec_parser_combinators.html

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><a id="ID-d377b6bc-e443-4723-8cec-12d2efb973f8" name="ID-d377b6bc-e443-4723-8cec-12d2efb973f8"></a><span class="section-number-4">1.1.3</span> Loader Script</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>
This section will assume that the script <span class="underline">parsecHelpers.hs</span> was loaded
with:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>script <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>parsecHelpers<span class="org-haskell-operator">.</span>hs 
<span class="org-function-name">apply</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> a
<span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">...</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>File:</b> <span class="underline">parsecHelpers.hs</span>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec.String</span> (<span class="org-haskell-constructor">Parser</span>)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec</span> ((<span class="org-haskell-operator">&lt;|&gt;</span>))
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">P</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec.Char</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">PC</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (void)

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Either</span> (isRight, isLeft)

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>     

<span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XFlexibleContexts</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">apply</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> a
<span class="org-haskell-definition">apply</span> p s <span class="org-haskell-operator">=</span>  P.parse p <span class="org-string">""</span> s
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">applyOpt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-definition">applyOpt</span> p s <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">case</span> P.parse p <span class="org-string">""</span> s <span class="org-haskell-keyword">of</span>
               <span class="org-haskell-constructor">Left</span> <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nothing</span>
               <span class="org-haskell-constructor">Right</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Just</span> a
<span class="org-haskell-constructor">:</span>}                 


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">run</span> p str <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> P.parse p <span class="org-string">""</span> str <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Left</span> err  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Parser Error"</span>
                      print err
      <span class="org-haskell-constructor">Right</span> res <span class="org-haskell-operator">-&gt;</span> print res
<span class="org-haskell-constructor">:</span>} 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parse single letter char</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pLetter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pLetter</span> <span class="org-haskell-operator">=</span> P.letter 
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parse single char</span>
<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">pChar</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Char</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pChar</span> x <span class="org-haskell-operator">=</span> P.char x
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parse single digit char</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pDigit</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pDigit</span> <span class="org-haskell-operator">=</span> P.digit
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parse string </span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pStr</span> str <span class="org-haskell-operator">=</span> P.string str 
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parse letter surrounded by parenthesis.</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  P.char <span class="org-string">'('</span>     <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume input '(' and discard result </span>
  s <span class="org-haskell-operator">&lt;-</span> P.letter  <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume the letter input and save it to s.</span>
  P.char <span class="org-string">')'</span>     <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume input ')' and discard result</span>
  return s       <span class="org-comment-delimiter">-- </span><span class="org-comment">Set parser result to s </span>
<span class="org-haskell-constructor">:</span>}  

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter2</span> <span class="org-haskell-operator">=</span> 
  P.char <span class="org-string">'('</span> <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span><span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">-&gt;</span>     
  P.letter   <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>s <span class="org-haskell-operator">-&gt;</span> 
  P.char <span class="org-string">')'</span> <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span><span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">-&gt;</span>    
  return s       
<span class="org-haskell-constructor">:</span>}  


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter3</span> <span class="org-haskell-operator">=</span> 
  P.char <span class="org-string">'('</span> <span class="org-haskell-operator">&gt;&gt;</span>
  P.letter   <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>s <span class="org-haskell-operator">-&gt;</span> 
  P.char <span class="org-string">')'</span> <span class="org-haskell-operator">&gt;&gt;</span>
  return s       
<span class="org-haskell-constructor">:</span>}  

<span class="org-comment-delimiter">--</span><span class="org-comment">- Parser Choice</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pChoice1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pChoice1</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"hello world"</span>
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"world"</span>)
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"Haskell"</span>)
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"ocaml"</span>)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pIdentifier1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pIdentifier1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  x  <span class="org-haskell-operator">&lt;-</span> P.letter
  xs <span class="org-haskell-operator">&lt;-</span> P.many (P.letter <span class="org-haskell-operator">&lt;|&gt;</span> P.try P.digit)
  return <span class="org-haskell-operator">$</span> x<span class="org-haskell-constructor">:</span>xs
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNumStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pNumStr</span> <span class="org-haskell-operator">=</span> P.many1 P.digit
<span class="org-haskell-constructor">:</span>}          

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  s <span class="org-haskell-operator">&lt;-</span> P.many1 P.digit
  return <span class="org-haskell-operator">$</span> read s   
<span class="org-haskell-constructor">:</span>}   


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum2</span> <span class="org-haskell-operator">=</span> fmap read <span class="org-haskell-operator">$</span> P.many1 P.digit
     <span class="org-comment-delimiter">-- </span><span class="org-comment">read &lt;$&gt; P.many P.digit</span>
<span class="org-haskell-constructor">:</span>}         


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pTrue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-definition">pTrue</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">True</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pFalse</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-definition">pFalse</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"false"</span> <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">False</span>
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">pCsvRow1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-definition">pCsvRow1</span> <span class="org-haskell-operator">=</span> P.sepBy pCell (pChar <span class="org-string">','</span>)
    <span class="org-haskell-keyword">where</span>
      pCell <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
        P.spaces
        num <span class="org-haskell-operator">&lt;-</span> pNum1
        P.spaces
        return num

<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
<b>Running parsers</b>
</p>

<p>
This parser recognizes a single letter ('a' to 'z'). When it suceeds
it returns a letter. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pLetter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pLetter</span> <span class="org-haskell-operator">=</span> P.letter 
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
The function <span class="underline">apply</span> applies a parser to an input string returning the
parser result (Result) or failure (Left).
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">apply</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> a
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">apply</span> pLetter <span class="org-string">"1"</span>
<span class="org-haskell-constructor">Left</span> (line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"1"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> <span class="org-haskell-type">Char</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">apply</span> pLetter <span class="org-string">""</span>
<span class="org-haskell-constructor">Left</span> (line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">apply</span> pLetter <span class="org-string">"2323"</span>
<span class="org-haskell-constructor">Left</span> (line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> <span class="org-haskell-type">Char</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pLetter <span class="org-string">"a"</span>
<span class="org-string">'a'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
</pre>
</div>

<p>
The function run applies a parser to an input string and prints the
the result. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pLetter <span class="org-string">"aa"</span>
<span class="org-string">'a'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pLetter <span class="org-string">"1aa"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"1"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pLetter <span class="org-string">" aa"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">" "</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
