haskell/Parsec_parser_combinators.org
** Parser Combinators
*** Primitive Parsers 
**** Parse Char

#+BEGIN_SRC haskell
:{
pChar :: Char -> Parser Char
pChar x = P.char x
:}
#+END_SRC

Running:

#+BEGIN_SRC haskell 
> run (pChar 'x') "x"
'x'
it :: ()
> run (pChar 'x') "xxxxx"
'x'
it :: ()
> run (pChar 'x') " x"
Parser Error
(line 1, column 1):
unexpected " "
expecting "x"
it :: ()
> run (pChar 'x') "213"
Parser Error
(line 1, column 1):
unexpected "2"
expecting "x"
it :: ()
> run (pChar 'x') "x213"
'x'
it :: ()
> 

#+END_SRC

**** Parse Digit

#+BEGIN_SRC haskell 
:{
pDigit :: Parser Char
pDigit = P.digit
:}
#+END_SRC

Running:

#+BEGIN_SRC haskell
> run pDigit "asd2323"
Parser Error
(line 1, column 1):
unexpected "a"
expecting digit
it :: ()
> run pDigit "1asd2323"
'1'
it :: ()
> run pDigit "1 asd2323"
'1'
it :: ()
> run pDigit " 1 asd2323"
Parser Error
(line 1, column 1):
unexpected " "
expecting digit
it :: ()
> 

#+END_SRC

**** Parse any character - anychar 

Consume anycharater returning it.

#+BEGIN_SRC haskell
anyChar :: Char -> Parser Char 
#+END_SRC

Example: 

#+BEGIN_SRC haskell
> run P.anyChar "world"
'w'
it :: ()
> run P.anyChar ""
Parser Error
(line 1, column 1):
unexpected end of input
it :: ()
> run P.anyChar "x"
'x'
it :: ()
> run P.anyChar "6586"
'6'
it :: ()
> 

#+END_SRC

**** TODO oneOf
**** TODO noneOf
**** Parse String 


#+BEGIN_SRC haskell 
-- Parse string 
:{
pStr :: String -> Parser String
pStr str = P.string str 
:}
#+END_SRC

Running:

#+BEGIN_SRC haskell 
> run (pStr "ok") "ok"
"ok"
it :: ()

> run (pStr "ok") "okResult"
"ok"
it :: ()
> 

> run (pStr "ok") "ok2324"
"ok"
it :: ()

> run (pStr "ok") " ok2324"
Parser Error
(line 1, column 1):
unexpected " "
expecting "ok"
it :: ()
> 

> run (pStr "ok") ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting "ok"
it :: ()
> 


#+END_SRC

*** Combinators 
