haskell/Parsec_parser_combinators.org
**** Monad do-notation - parse sequence 

It parses a letter surrounded by parenthesis. The do-notation and the
monad combinators (>>) and (>>=) sequences the parsers ~(P.char ')')~,
~P.letter~ and ~(P.char ')')~.

#+BEGIN_SRC haskell
:{
pParenLetter :: Parser Char
pParenLetter = do
  P.char '('     -- Consume input '(' and discard result 
  s <- P.letter  -- Consume the letter input and save it to s.
  P.char ')'     -- Consume input ')' and discard result
  return s       -- Set parser result to s 
:}  

-- Parsers without syntax sugar.
-- 

:{
pParenLetter2 :: Parser Char
pParenLetter2 = 
  P.char '(' >>= \_ ->     
  P.letter   >>= \s -> 
  P.char ')' >>= \_ ->    
  return s       
:}  


:{
pParenLetter3 :: Parser Char
pParenLetter3 = 
  P.char '(' >>
  P.letter   >>= \s -> 
  P.char ')' >>
  return s       
:}  
#+END_SRC

Running: 

#+BEGIN_SRC haskell
> run pParenLetter "(x)"
'x'
it :: ()

> run pParenLetter "(a)"
'a'
it :: ()

> run pParenLetter "(4)"
Parser Error
(line 1, column 2):
unexpected "4"
expecting letter
it :: ()

> run pParenLetter "(223)"
Parser Error
(line 1, column 2):
unexpected "2"
expecting letter
it :: ()

> run pParenLetter "(twesa223)"
Parser Error
(line 1, column 3):
unexpected "w"
expecting ")"
it :: ()

> run pParenLetter3 "(x)"
'x'
it :: ()
> run pParenLetter3 "(ax)"
Parser Error
(line 1, column 3):
unexpected "x"
expecting ")"
it :: ()
> 
#+END_SRC

**** Functor fmap and operator (<$>)

The function fmap or the operator (<$>) that is a fmap synonym apply a
function to the parser result.

#+BEGIN_SRC haskell 
fmap  :: (a -> b) -> Parser a -> Parser b
(<$>) :: (a -> b) -> Parser a -> Parser b
#+END_SRC

Example:

#+BEGIN_SRC haskell 
> let pNumStr = P.many1 P.digit :: Parser String
pNumStr :: Parser String
> 

> run (fmap read pNumStr) "2323" 
 *** Exception: Prelude.read: no parse
> 

> run (fmap read pNumStr :: Parser Int) "2323"
2323
it :: ()

> run (fmap read pNumStr :: Parser Int) ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting digit
it :: ()

> run (fmap read pNumStr :: Parser Int) "100"
100
it :: ()
> 

> run (read <$> pNumStr :: Parser Int) "100"
100
it :: ()
> run ((+120) <$> read <$> pNumStr :: Parser Int) "100"
220
it :: ()

> run ((*3) <$> (+120) <$> read <$> pNumStr :: Parser Int) "100"
660
it :: ()
> 

> run ((*3) . (+120) . read <$> pNumStr :: Parser Int) "100"
660
it :: ()
> 

#+END_SRC

**** Monad operators return, (>>=) and >> 
