haskell/Parsec_parser_combinators.html

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Combinators</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Monad do-notation - parse sequence<br  /><div class="outline-text-5" id="text-1-2-2-1">
<p>
It parses a letter surrounded by parenthesis. The do-notation and the
monad combinators (&gt;&gt;) and (&gt;&gt;=) sequences the parsers <code>(P.char ')')</code>,
<code>P.letter</code> and <code>(P.char ')')</code>.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  P.char <span class="org-string">'('</span>     <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume input '(' and discard result </span>
  s <span class="org-haskell-operator">&lt;-</span> P.letter  <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume the letter input and save it to s.</span>
  P.char <span class="org-string">')'</span>     <span class="org-comment-delimiter">-- </span><span class="org-comment">Consume input ')' and discard result</span>
  return s       <span class="org-comment-delimiter">-- </span><span class="org-comment">Set parser result to s </span>
<span class="org-haskell-constructor">:</span>}  

<span class="org-comment-delimiter">-- </span><span class="org-comment">Parsers without syntax sugar.</span>
<span class="org-comment-delimiter">-- </span>

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter2</span> <span class="org-haskell-operator">=</span> 
  P.char <span class="org-string">'('</span> <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span><span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">-&gt;</span>     
  P.letter   <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>s <span class="org-haskell-operator">-&gt;</span> 
  P.char <span class="org-string">')'</span> <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span><span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">-&gt;</span>    
  return s       
<span class="org-haskell-constructor">:</span>}  


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pParenLetter3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Char</span>
<span class="org-haskell-definition">pParenLetter3</span> <span class="org-haskell-operator">=</span> 
  P.char <span class="org-string">'('</span> <span class="org-haskell-operator">&gt;&gt;</span>
  P.letter   <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>s <span class="org-haskell-operator">-&gt;</span> 
  P.char <span class="org-string">')'</span> <span class="org-haskell-operator">&gt;&gt;</span>
  return s       
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter <span class="org-string">"(x)"</span>
<span class="org-string">'x'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter <span class="org-string">"(a)"</span>
<span class="org-string">'a'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter <span class="org-string">"(4)"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"4"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter <span class="org-string">"(223)"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter <span class="org-string">"(twesa223)"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 3)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"w"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">")"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter3 <span class="org-string">"(x)"</span>
<span class="org-string">'x'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pParenLetter3 <span class="org-string">"(ax)"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 3)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"x"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">")"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Functor fmap and operator (&lt;$&gt;)<br  /><div class="outline-text-5" id="text-1-2-2-2">
<p>
The function fmap or the operator (&lt;$&gt;) that is a fmap synonym apply a
function to the parser result.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">fmap</span>  <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b
(<span class="org-haskell-definition">&lt;$&gt;</span>) <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> pNumStr <span class="org-haskell-operator">=</span> P.many1 P.digit <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-function-name">pNumStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (fmap read pNumStr) <span class="org-string">"2323"</span> 
 <span class="org-haskell-operator">***</span> <span class="org-haskell-type">Exception:</span> Prelude.read<span class="org-haskell-type">:</span> no parse
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (fmap read pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"2323"</span>
2323
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (fmap read pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (fmap read pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"100"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (read <span class="org-haskell-operator">&lt;$&gt;</span> pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"100"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> ((<span class="org-haskell-operator">+</span>120) <span class="org-haskell-operator">&lt;$&gt;</span> read <span class="org-haskell-operator">&lt;$&gt;</span> pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"100"</span>
220
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> ((<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">&lt;$&gt;</span> (<span class="org-haskell-operator">+</span>120) <span class="org-haskell-operator">&lt;$&gt;</span> read <span class="org-haskell-operator">&lt;$&gt;</span> pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"100"</span>
660
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> ((<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">+</span>120) <span class="org-haskell-operator">.</span> read <span class="org-haskell-operator">&lt;$&gt;</span> pNumStr <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>) <span class="org-string">"100"</span>
660
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
