haskell/Parsec_parser_combinators.org
***** Function return

Creates a parser that always returns the same value regardless of the
input.

#+BEGIN_SRC haskell
return :: a -> Parser a
#+END_SRC

Example: 

#+BEGIN_SRC haskell
> run (return 10) "hello"
10
it :: ()
> run (return 10) "" 
10
it :: ()
> run (return 10) "world" 
10
it :: ()
> 

> run (return True) "true" 
True
it :: ()
> run (return True) "" 
True
it :: ()
> run (return True) "23123" 
True
it :: ()
> 

#+END_SRC

***** Operator (>>)

Run parserA discarding its result and then run parserB returning its
result.

#+BEGIN_SRC haskell
(>>) :: Parser a -> Parser b -> Parser b
parserA >> parserB
#+END_SRC

Example:

#+BEGIN_SRC haskell
   
:{
pTrue :: Parser Bool
pTrue = P.string "true" >> return True
:}

:{
pFalse :: Parser Bool
pFalse = P.string "false" >> return False
:}
#+END_SRC

Running:

#+BEGIN_SRC haskell
  > run pTrue "true"
  True
  it :: ()
  > run pTrue "23true"
  Parser Error
  (line 1, column 1):
  unexpected "2"
  expecting "true"
  it :: ()
  > run pTrue ""
  Parser Error
  (line 1, column 1):
  unexpected end of input
  expecting "true"
  it :: ()
  > 

  > run pFalse "false"
  False
  it :: ()

  > run pFalse "falsex"
  False
  it :: ()

  > run pFalse "xfalse"
  Parser Error
  (line 1, column 1):
  unexpected "x"
  expecting "false"
  it :: ()
  > 

  > let pBool = pTrue <|> P.try pFalse :: Parser Bool
  pBool :: Parser Bool
  > 

  > 
  > run pBool "true"
  True
  it :: ()
  > run pBool "false"
  False
  it :: ()
  > run pBool "232"
  Parser Error
  (line 1, column 1):
  unexpected "2"
  expecting "true" or "false"
  it :: ()
  > 

  :{
  pBool2 :: Parser Bool 
  pBool2 = pTrue <|> P.try pFalse
      where
        pTrue  = P.string "true"  >> return True
        pFalse = P.string "false" >> return False
  :}

  > run pBool2 "true"
  True
  it :: ()
        
  > run pBool2 "false"
  False
  it :: ()

  > run pBool2 "asdas"
  Parser Error
  (line 1, column 1):
  unexpected "a"
  expecting "true" or "false"
  it :: ()
        
  > run pBool2 ""
  Parser Error
  (line 1, column 1):
  unexpected end of input
  expecting "true" or "false"
  it :: ()
  > 
   
#+END_SRC

***** TODO Operator (>>=) bind

#+BEGIN_SRC haskell
(>>=) :: Parser a -> (a -> Parser b) -> Parser b
#+END_SRC
**** Applicative operators (<*), (*>) and (<*>)
