haskell/Parsec_parser_combinators.html

<li><a id="sec-1-2-2-3" name="sec-1-2-2-3"></a>Monad operators return, (&gt;&gt;=) and &gt;&gt;<br  /><ol class="org-ol"><li><a id="sec-1-2-2-3-1" name="sec-1-2-2-3-1"></a>Function return<br  /><div class="outline-text-6" id="text-1-2-2-3-1">
<p>
Creates a parser that always returns the same value regardless of the
input.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">return</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return 10) <span class="org-string">"hello"</span>
10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return 10) <span class="org-string">""</span> 
10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return 10) <span class="org-string">"world"</span> 
10
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return <span class="org-haskell-type">True</span>) <span class="org-string">"true"</span> 
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return <span class="org-haskell-type">True</span>) <span class="org-string">""</span> 
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (return <span class="org-haskell-type">True</span>) <span class="org-string">"23123"</span> 
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-3-2" name="sec-1-2-2-3-2"></a>Operator (&gt;&gt;)<br  /><div class="outline-text-6" id="text-1-2-2-3-2">
<p>
Run parserA discarding its result and then run parserB returning its
result.
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">&gt;&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b
parserA <span class="org-haskell-definition">&gt;&gt;</span> parserB
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pTrue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-definition">pTrue</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">True</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pFalse</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-definition">pFalse</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"false"</span> <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">False</span>
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pTrue <span class="org-string">"true"</span>
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pTrue <span class="org-string">"23true"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pTrue <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pFalse <span class="org-string">"false"</span>
<span class="org-haskell-constructor">False</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pFalse <span class="org-string">"falsex"</span>
<span class="org-haskell-constructor">False</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pFalse <span class="org-string">"xfalse"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"x"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"false"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> pBool <span class="org-haskell-operator">=</span> pTrue <span class="org-haskell-operator">&lt;|&gt;</span> P.try pFalse <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-function-name">pBool</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool <span class="org-string">"true"</span>
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool <span class="org-string">"false"</span>
<span class="org-haskell-constructor">False</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool <span class="org-string">"232"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span> or <span class="org-string">"false"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{
<span class="org-function-name">pBool2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Bool</span> 
<span class="org-haskell-definition">pBool2</span> <span class="org-haskell-operator">=</span> pTrue <span class="org-haskell-operator">&lt;|&gt;</span> P.try pFalse
    <span class="org-haskell-keyword">where</span>
      pTrue  <span class="org-haskell-operator">=</span> P.string <span class="org-string">"true"</span>  <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">True</span>
      pFalse <span class="org-haskell-operator">=</span> P.string <span class="org-string">"false"</span> <span class="org-haskell-operator">&gt;&gt;</span> return <span class="org-haskell-constructor">False</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool2 <span class="org-string">"true"</span>
<span class="org-haskell-constructor">True</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool2 <span class="org-string">"false"</span>
<span class="org-haskell-constructor">False</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool2 <span class="org-string">"asdas"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"a"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span> or <span class="org-string">"false"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pBool2 <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span> or <span class="org-string">"false"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-3-3" name="sec-1-2-2-3-3"></a><span class="todo TODO">TODO</span> Operator (&gt;&gt;=) bind<br  /><div class="outline-text-6" id="text-1-2-2-3-3">
<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">&gt;&gt;=</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b
</pre>
</div>
</div>
</li></ol>
</li>
<li><a id="sec-1-2-2-4" name="sec-1-2-2-4"></a>Applicative operators (&lt;*), (*&gt;) and (&lt;*&gt;)<br  /><ol class="org-ol"><li><a id="sec-1-2-2-4-1" name="sec-1-2-2-4-1"></a>Operator (*&gt;)<br  /><div class="outline-text-6" id="text-1-2-2-4-1">
<p>
