haskell/Parsec_parser_combinators.org
***** Operator (*>)

Run two parsers and returns the result of second one.

#+BEGIN_SRC haskell
(*>) :: Applicative f => f a -> f b -> f b
(*>) :: Parser a -> Parser b -> Parser b    -- For Parsec 
resultB = parserA *> parserB                -- Mneumonic
#+END_SRC

Example: Parse the word 'true' followed by number returning it.

#+BEGIN_SRC haskell
:{
pNum :: Parser Int
pNum = fmap read $ P.many1 P.digit
:}   

> run (P.string "true" *> pNum) "true1003"
1003
it :: ()

> run (P.string "true" *> pNum) "tru1003"
Parser Error
(line 1, column 1):
unexpected "1"
expecting "true"
it :: ()

> run (P.string "true" *> pNum) "1003"
Parser Error
(line 1, column 1):
unexpected "1"
expecting "true"
it :: ()
> 
> run (P.string "true" *> pNum) "true"
Parser Error
(line 1, column 5):
unexpected end of input
expecting digit
it :: ()
> 


#+END_SRC

***** Operator (<*)

Run two parsers and returns the result of the first one.

#+BEGIN_SRC haskell
(<*) :: Applicative f => f a -> f b -> f a
(<*) :: Parser a -> Parser b -> Parser a    -- For Parsec 
resultA = parserA <* parserB                -- Mneumonic
#+END_SRC

Example: Parse a number followed by word true returning the number.

#+BEGIN_SRC haskell
:{
pNum :: Parser Int
pNum = fmap read $ P.many1 P.digit
:}   

> run (pNum <* P.string "true") "100true"
100
it :: ()

> run (pNum <* P.string "true") "1200true"
1200
it :: ()
> run ((*3) <$> pNum <* P.string "true") "1200true"
3600
it :: ()

> run (pNum <* P.string "true") "1200"
Parser Error
(line 1, column 5):
unexpected end of input
expecting digit or "true"
it :: ()

> run (pNum <* P.string "true") ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting digit
it :: ()

> run (pNum <* P.string "true") "9"
Parser Error
(line 1, column 2):
unexpected end of input
expecting digit or "true"
it :: ()

> run (pNum <* P.string "true") "true"
Parser Error
(line 1, column 1):
unexpected "t"
expecting digit
it :: ()
> 

#+END_SRC

***** TODO Operator (<*>)
