haskell/Parsec_parser_combinators.html
Run two parsers and returns the result of second one.
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">*&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Applicative</span> f <span class="org-haskell-operator">=&gt;</span> f a <span class="org-haskell-operator">-&gt;</span> f b <span class="org-haskell-operator">-&gt;</span> f b
(<span class="org-haskell-definition">*&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b    <span class="org-comment-delimiter">-- </span><span class="org-comment">For Parsec </span>
<span class="org-haskell-definition">resultB</span> <span class="org-haskell-operator">=</span> parserA <span class="org-haskell-operator">*&gt;</span> parserB                <span class="org-comment-delimiter">-- </span><span class="org-comment">Mneumonic</span>
</pre>
</div>

<p>
Example: Parse the word 'true' followed by number returning it.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> fmap read <span class="org-haskell-operator">$</span> P.many1 P.digit
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">*&gt;</span> pNum) <span class="org-string">"true1003"</span>
1003
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">*&gt;</span> pNum) <span class="org-string">"tru1003"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"1"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">*&gt;</span> pNum) <span class="org-string">"1003"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"1"</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.string <span class="org-string">"true"</span> <span class="org-haskell-operator">*&gt;</span> pNum) <span class="org-string">"true"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 5)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-4-2" name="sec-1-2-2-4-2"></a>Operator (&lt;*)<br  /><div class="outline-text-6" id="text-1-2-2-4-2">
<p>
Run two parsers and returns the result of the first one.
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">&lt;*</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Applicative</span> f <span class="org-haskell-operator">=&gt;</span> f a <span class="org-haskell-operator">-&gt;</span> f b <span class="org-haskell-operator">-&gt;</span> f a
(<span class="org-haskell-definition">&lt;*</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a    <span class="org-comment-delimiter">-- </span><span class="org-comment">For Parsec </span>
<span class="org-haskell-definition">resultA</span> <span class="org-haskell-operator">=</span> parserA <span class="org-haskell-operator">&lt;*</span> parserB                <span class="org-comment-delimiter">-- </span><span class="org-comment">Mneumonic</span>
</pre>
</div>

<p>
Example: Parse a number followed by word true returning the number.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> fmap read <span class="org-haskell-operator">$</span> P.many1 P.digit
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"100true"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"1200true"</span>
1200
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> ((<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">&lt;$&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"1200true"</span>
3600
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"1200"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 5)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit or <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"9"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit or <span class="org-string">"true"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.string <span class="org-string">"true"</span>) <span class="org-string">"true"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"t"</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
