haskell/Parsec_parser_combinators.org
**** Parser choice (<|>) operator

The parser choice operator (<|>) only will try the second alternative
parser if the first parser has failed and not consummed any input.

The operator try makes the parser consume any input if it has failed.

#+BEGIN_SRC haskell
(<|>) :: Parser a -> Parser a -> Parser a
parser1 <|> parser2 
parser1 <|> parser2 <|> parser3 <|> parser4 ... 
#+END_SRC

#+BEGIN_SRC haskell
--- Parser Choice
:{
pChoice1 :: Parser String
pChoice1 = P.string "hello world"
       <|> P.try (P.string "world")
       <|> P.try (P.string "Haskell")
       <|> P.try (P.string "ocaml")
:}           
#+END_SRC

Running:

#+BEGIN_SRC haskell 
> run pChoice1 "world"
"world"
it :: ()
> 
> run pChoice1 "Haskell"
"Haskell"
it :: ()
> 
> run pChoice1 "ocaml"
"ocaml"
it :: ()
> 
> run pChoice1 "ocamlHaskell"
"ocaml"
it :: ()
> 

> run pChoice1 "Haskellocaml"
"Haskell"
it :: ()
> 

> run pChoice1 " Haskellocaml"
Parser Error
(line 1, column 1):
unexpected " "
expecting "hello world", "world", "Haskell" or "ocaml"
it :: ()

> run pChoice1 "hello"
Parser Error
(line 1, column 1):
unexpected end of input
expecting "hello world"
it :: ()
> 

#+END_SRC

**** TODO choice 
**** many 

*Simplified signature:*

Applies a parser zero or more times, returning a list of parser results.

#+BEGIN_SRC haskell
many :: Parser a -> Parser [a]
#+END_SRC

Example 1: Parse a string with only letters

#+BEGIN_SRC haskell
> run pLetter "helloworld"
'h'
it :: ()
> run (P.many pLetter) "helloworld"
"helloworld"
it :: ()
> run (P.many pLetter) "helloworld haskell"
"helloworld"
it :: ()
> run (P.many pLetter) "hello2321321"
"hello"
it :: ()
> run (P.many pLetter) ""
""
it :: ()
> run (P.many pLetter) "32423"
""
it :: ()
> run (P.many pLetter) "asdas32423"
"asdas"
it :: ()
> run (P.many pLetter) "0&823asdas32423"
""
it :: ()
> 

#+END_SRC

Example 2: Parse an identifier. Starts with a letter followed by zero
or more letter or digit.

#+BEGIN_SRC haskell
:{
pIdentifier1 :: Parser String
pIdentifier1 = do
  x  <- P.letter
  xs <- P.many (P.letter <|> P.try P.digit)
  return $ x:xs
:}  
#+END_SRC

#+BEGIN_SRC haskell
> run pIdentifier1 "hello"
"hello"
it :: ()
> run pIdentifier1 "h10"
"h10"
it :: ()
> run pIdentifier1 "a013"
"a013"
it :: ()
> run pIdentifier1 "23a013"
Parser Error
(line 1, column 1):
unexpected "2"
expecting letter
it :: ()
> run pIdentifier1 "-013"
Parser Error
(line 1, column 1):
unexpected "-"
expecting letter
it :: ()
> run pIdentifier1 "a"
"a"
it :: ()
> run pIdentifier1 "a-xf9"
"a"
it :: ()
> 

#+END_SRC

