haskell/Parsec_parser_combinators.html

<li><a id="sec-1-2-2-4-3" name="sec-1-2-2-4-3"></a><span class="todo TODO">TODO</span> Operator (&lt;*&gt;)<br  /></li></ol>
</li>
<li><a id="sec-1-2-2-5" name="sec-1-2-2-5"></a>Parser choice (&lt;|&gt;) operator<br  /><div class="outline-text-5" id="text-1-2-2-5">
<p>
The parser choice operator (&lt;|&gt;) only will try the second alternative
parser if the first parser has failed and not consummed any input.
</p>

<p>
The operator try makes the parser consume any input if it has failed.
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">&lt;|&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> a
parser1 <span class="org-haskell-definition">&lt;|&gt;</span> parser2 
parser1 <span class="org-haskell-definition">&lt;|&gt;</span> parser2 <span class="org-haskell-operator">&lt;|&gt;</span> parser3 <span class="org-haskell-operator">&lt;|&gt;</span> parser4 <span class="org-haskell-operator">...</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">--</span><span class="org-comment">- Parser Choice</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pChoice1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pChoice1</span> <span class="org-haskell-operator">=</span> P.string <span class="org-string">"hello world"</span>
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"world"</span>)
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"Haskell"</span>)
       <span class="org-haskell-operator">&lt;|&gt;</span> P.try (P.string <span class="org-string">"ocaml"</span>)
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"world"</span>
<span class="org-string">"world"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"Haskell"</span>
<span class="org-string">"Haskell"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"ocaml"</span>
<span class="org-string">"ocaml"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"ocamlHaskell"</span>
<span class="org-string">"ocaml"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"Haskellocaml"</span>
<span class="org-string">"Haskell"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">" Haskellocaml"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">" "</span>
<span class="org-haskell-definition">expecting</span> <span class="org-string">"hello world"</span>, <span class="org-string">"world"</span>, <span class="org-string">"Haskell"</span> or <span class="org-string">"ocaml"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pChoice1 <span class="org-string">"hello"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> <span class="org-string">"hello world"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-6" name="sec-1-2-2-6"></a><span class="todo TODO">TODO</span> choice<br  /></li>
<li><a id="sec-1-2-2-7" name="sec-1-2-2-7"></a>many<br  /><div class="outline-text-5" id="text-1-2-2-7">
<p>
<b>Simplified signature:</b>
</p>

<p>
Applies a parser zero or more times, returning a list of parser results.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">many</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> [a]
</pre>
</div>

<p>
Example 1: Parse a string with only letters
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pLetter <span class="org-string">"helloworld"</span>
<span class="org-string">'h'</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"helloworld"</span>
<span class="org-string">"helloworld"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"helloworld haskell"</span>
<span class="org-string">"helloworld"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"hello2321321"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">""</span>
<span class="org-string">""</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"32423"</span>
<span class="org-string">""</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"asdas32423"</span>
<span class="org-string">"asdas"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many pLetter) <span class="org-string">"0&amp;823asdas32423"</span>
<span class="org-string">""</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example 2: Parse an identifier. Starts with a letter followed by zero
or more letter or digit.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pIdentifier1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pIdentifier1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  x  <span class="org-haskell-operator">&lt;-</span> P.letter
  xs <span class="org-haskell-operator">&lt;-</span> P.many (P.letter <span class="org-haskell-operator">&lt;|&gt;</span> P.try P.digit)
  return <span class="org-haskell-operator">$</span> x<span class="org-haskell-constructor">:</span>xs
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"hello"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"h10"</span>
<span class="org-string">"h10"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"a013"</span>
<span class="org-string">"a013"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"23a013"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"-013"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"-"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"a"</span>
<span class="org-string">"a"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pIdentifier1 <span class="org-string">"a-xf9"</span>
<span class="org-string">"a"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
