haskell/Parsec_parser_combinators.org
**** many1

*Simplified signature:*

Applies a parser one or more times, returning a list of parser results.

#+BEGIN_SRC haskell
many1 :: Parser a -> Parser [a]
#+END_SRC

*Example 1*

#+BEGIN_SRC haskell
> 
> run (P.many1 pLetter) "hello"
"hello"
it :: ()
> 
> run (P.many1 pLetter) "h"
"h"
it :: ()
> run (P.many1 pLetter) "hello"
"hello"
it :: ()
> run (P.many1 pLetter) "hello world"
"hello"
it :: ()
> run (P.many1 pLetter) "hello2321"
"hello"
it :: ()
> run (P.many1 pLetter) ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting letter
it :: ()
> 
> run (P.many1 pLetter) "2321hello"
Parser Error
(line 1, column 1):
unexpected "2"
expecting letter
it :: ()
> 

#+END_SRC

*Example 2* Parse an integer. 

#+BEGIN_SRC haskell
:{
pNumStr :: Parser String
pNumStr = P.many1 P.digit
:}          

:{
pNum1 :: Parser Int
pNum1 = do
  s <- P.many1 P.digit
  return $ read s   
:}   


:{
pNum2 :: Parser Int
pNum2 = fmap read $ P.many1 P.digit
     -- read <$> P.many P.digit
:}         
 
#+END_SRC

Running:

#+BEGIN_SRC haskell
> run pNumStr "2300"
"2300"
it :: ()
> run pNumStr "1002"
"1002"
it :: ()
> run pNumStr ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting digit
it :: ()
> run pNumStr "as2323"
Parser Error
(line 1, column 1):
unexpected "a"
expecting digit
it :: ()
> run pNumStr "1000as2323"
"1000"
it :: ()
> 

> run pNum1 ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting digit
it :: ()
> run pNum1 "asa123"
Parser Error
(line 1, column 1):
unexpected "a"
expecting digit
it :: ()
> run pNum1 "134asa"
134
it :: ()
> 
#+END_SRC
