haskell/Parsec_parser_combinators.html

<li><a id="sec-1-2-2-8" name="sec-1-2-2-8"></a>many1<br  /><div class="outline-text-5" id="text-1-2-2-8">
<p>
<b>Simplified signature:</b>
</p>

<p>
Applies a parser one or more times, returning a list of parser results.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">many1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> [a]
</pre>
</div>

<p>
<b>Example 1</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"hello"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"h"</span>
<span class="org-string">"h"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"hello"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"hello world"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"hello2321"</span>
<span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.many1 pLetter) <span class="org-string">"2321hello"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> letter
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example 2</b> Parse an integer. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNumStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">pNumStr</span> <span class="org-haskell-operator">=</span> P.many1 P.digit
<span class="org-haskell-constructor">:</span>}          

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum1</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  s <span class="org-haskell-operator">&lt;-</span> P.many1 P.digit
  return <span class="org-haskell-operator">$</span> read s   
<span class="org-haskell-constructor">:</span>}   


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum2</span> <span class="org-haskell-operator">=</span> fmap read <span class="org-haskell-operator">$</span> P.many1 P.digit
     <span class="org-comment-delimiter">-- </span><span class="org-comment">read &lt;$&gt; P.many P.digit</span>
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumStr <span class="org-string">"2300"</span>
<span class="org-string">"2300"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumStr <span class="org-string">"1002"</span>
<span class="org-string">"1002"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumStr <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumStr <span class="org-string">"as2323"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"a"</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumStr <span class="org-string">"1000as2323"</span>
<span class="org-string">"1000"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum1 <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum1 <span class="org-string">"asa123"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"a"</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum1 <span class="org-string">"134asa"</span>
134
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
