haskell/Parsec_parser_combinators.org
**** sepBy 

Returns zero or more occurences of parser p separated by separator
sep.

#+BEGIN_SRC haskell
sepBy :: Parser a -> Parser sep -> Parser [a]
#+END_SRC

*Example 1:*

#+BEGIN_SRC haskell 
> run pNum1 "100"
100
it :: ()

> run pNum1 "2000"
2000
it :: ()
> 

> run (P.sepBy pNum1 (P.char ',')) "100,200,500,600"
[100,200,500,600]
it :: ()
> 
> run (P.sepBy pNum1 (P.char ',')) ""
[]
it :: ()
> run (P.sepBy pNum1 (P.char ',')) "asdas"
[]
it :: ()
> run (P.sepBy pNum1 (P.char ',')) "error"
[]
it :: ()
> run (P.sepBy pNum1 (P.char ',')) " 100,200,500,600"
[]
it :: ()
> run (P.sepBy pNum1 (P.char ',')) "100,200,  500,600"
Parser Error
(line 1, column 9):
unexpected " "
expecting digit
it :: ()
> run (P.sepBy pNum1 (P.char ',')) "100,200  ,500,600"
[100,200]
it :: ()
> 



#+END_SRC

*Example 2:* 

#+BEGIN_SRC haskell
:{ 
pCsvRow1 :: Parser [Int]
pCsvRow1 = P.sepBy pCell (pChar ',')
    where
      pCell = do
        P.spaces
        num <- pNum1
        P.spaces
        return num

:}    
#+END_SRC

Example: 

#+BEGIN_SRC haskell
> 
> run pCsvRow1 "100,200 ,300, 400,    500"
[100,200,300,400,500]
it :: ()
> 
> run pCsvRow1 "100,200 ,300, 400,    500 aaa bb cc"
[100,200,300,400,500]
it :: ()
> run pCsvRow1 "100,200 ,300, 400  ,    500 , aaa bb cc"
Parser Error
(line 1, column 31):
unexpected "a"
expecting space or digit
it :: ()
> 
> run pCsvRow1 "100,200 ,300, 400  ,    500"
[100,200,300,400,500]
it :: ()
> run pCsvRow1 "100  , 200 ,300, 400  ,    500"
[100,200,300,400,500]
it :: ()
> 

> run pCsvRow1 ""
[]
it :: ()
> run pCsvRow1 "asdasd"
[]
it :: ()
> run pCsvRow1 "asdasd,"
[]
it :: ()
> run pCsvRow1 "asdasd,566"
[]
it :: ()
> 

#+END_SRC
