haskell/Parsec_parser_combinators.html
<li><a id="sec-1-2-2-9" name="sec-1-2-2-9"></a>sepBy<br  /><div class="outline-text-5" id="text-1-2-2-9">
<p>
Returns zero or more occurences of parser p separated by separator
sep.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">sepBy</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> sep <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> [a]
</pre>
</div>

<p>
<b>Example 1:</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum1 <span class="org-string">"100"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum1 <span class="org-string">"2000"</span>
2000
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">"100,200,500,600"</span>
[100,200,500,600]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">""</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">"asdas"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">"error"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">" 100,200,500,600"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">"100,200,  500,600"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 9)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">" "</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.sepBy pNum1 (P.char <span class="org-string">','</span>)) <span class="org-string">"100,200  ,500,600"</span>
[100,200]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example 2:</b> 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">pCsvRow1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-definition">pCsvRow1</span> <span class="org-haskell-operator">=</span> P.sepBy pCell (pChar <span class="org-string">','</span>)
    <span class="org-haskell-keyword">where</span>
      pCell <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
        P.spaces
        num <span class="org-haskell-operator">&lt;-</span> pNum1
        P.spaces
        return num

<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"100,200 ,300, 400,    500"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"100,200 ,300, 400,    500 aaa bb cc"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"100,200 ,300, 400  ,    500 , aaa bb cc"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 31)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"a"</span>
<span class="org-haskell-definition">expecting</span> space or digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"100,200 ,300, 400  ,    500"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"100  , 200 ,300, 400  ,    500"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">""</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"asdasd"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"asdasd,"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCsvRow1 <span class="org-string">"asdasd,566"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
