haskell/Parsec_parser_combinators.org
**** between 

#+BEGIN_SRC haskell
between :: Parser open -> Parser close -> Parser p -> Parser p 
#+END_SRC

*Example 1: Parse a number between parenthesis*

#+BEGIN_SRC haskell
:{
pNum :: Parser Int
pNum = read <$> P.many1 P.digit    
:}  
#+END_SRC

#+BEGIN_SRC haskell
  > run (P.between (P.char '(') (P.char ')') pNum) "()"
  Parser Error
  (line 1, column 2):
  unexpected ")"
  expecting digit
  it :: ()
  > run (P.between (P.char '(') (P.char ')') pNum) "(22383)"
  22383
  it :: ()
  > run (P.between (P.char '(') (P.char ')') pNum) "( 22383 )"
  Parser Error
  (line 1, column 2):
  unexpected " "
  expecting digit
  it :: ()
  > 

  > run (P.between (P.char '(') (P.char ')') (P.spaces *> pNum <* P.spaces)) "(  22383)"
  22383
  it :: ()
  > 
  > run (P.between (P.char '(') (P.char ')') (P.spaces *> pNum <* P.spaces)) "(  22383  )"
  22383
  it :: ()
  > run (P.between (P.char '(') (P.char ')') (P.spaces *> pNum <* P.spaces)) "(22383)"
  22383
  it :: ()
  > 

  :{
  pExpr :: Parser Int
  pExpr = P.between (P.char '(') (P.char ')') p
      where
        p = P.spaces *> pNum <* P.spaces
  :}


  :{
  pExpr2 :: Parser Int
  pExpr2 = P.between (P.char '(') (P.char ')') p
      where
        p = do
          P.spaces
          num <- pNum
          P.spaces
          return num 
  :}
   

   > run pExpr "( 100 )"
  100
  it :: ()
  > run pExpr "( 100 2100 )"
  Parser Error
  (line 1, column 7):
  unexpected "2"
  expecting space or ")"
  it :: ()
  > run pExpr "(2023 )"
  2023
  it :: ()
  > run pExpr "( 2023)"
  2023
  it :: ()
  > run pExpr "( 2023)  "
  2023
  it :: ()
  > run pExpr "( 2023)  asdasdas"
  2023
  it :: ()
  > 


  > run pExpr2 "(2300)"
  2300
  it :: ()
  > run pExpr2 "(  2300  )"
  2300
  it :: ()
  > 

#+END_SRC


*Example 2 : Parse list of numbers between curly brackets.*

#+BEGIN_SRC haskell
  :{
  pNum :: Parser Int
  pNum = read <$> P.many1 P.digit    
  :}  


  :{
  pNumList :: Parser [Int]
  pNumList = P.between open close pList
      where
        open = P.char '{' >> P.spaces
        close = P.spaces >> P.char '}'
        pList = P.sepBy (P.spaces *> pNum <* P.spaces) (P.char ',')        
  :}


  > run pNumList "{100 , 200, 300, 400, 500}"
  [100,200,300,400,500]
  it :: ()
  > run pNumList "{100 , 200, 300, 400, 500  }"
  [100,200,300,400,500]
  it :: ()
  > run pNumList "{  100 , 200, 300, 400, 500  }"
  [100,200,300,400,500]
  it :: ()
  > run pNumList "{  100 }"
  [100]
  it :: ()
  > run pNumList "{100}"
  [100]
  it :: ()
  > run pNumList "{}"
  []
  it :: ()
  > 


  > run pNumList ""
  Parser Error
  (line 1, column 1):
  unexpected end of input
  expecting "{"
  it :: ()
        
  > run pNumList "{"
  Parser Error
  (line 1, column 2):
  unexpected end of input
  expecting white space, digit or "}"
  it :: ()
  > 

    
#+END_SRC

