haskell/Parsec_parser_combinators.html
<li><a id="sec-1-2-2-10" name="sec-1-2-2-10"></a>between<br  /><div class="outline-text-5" id="text-1-2-2-10">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">between</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> open <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> close <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> p <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Parser</span> p
</pre>
</div>

<p>
<b>Example 1: Parse a number between parenthesis</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> read <span class="org-haskell-operator">&lt;$&gt;</span> P.many1 P.digit    
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) pNum) <span class="org-string">"()"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">")"</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) pNum) <span class="org-string">"(22383)"</span>
22383
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) pNum) <span class="org-string">"( 22383 )"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">" "</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) (P.spaces <span class="org-haskell-operator">*&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.spaces)) <span class="org-string">"(  22383)"</span>
22383
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) (P.spaces <span class="org-haskell-operator">*&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.spaces)) <span class="org-string">"(  22383  )"</span>
22383
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) (P.spaces <span class="org-haskell-operator">*&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.spaces)) <span class="org-string">"(22383)"</span>
22383
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-type">:</span>{
<span class="org-function-name">pExpr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pExpr</span> <span class="org-haskell-operator">=</span> P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) p
    <span class="org-haskell-keyword">where</span>
      p <span class="org-haskell-operator">=</span> P.spaces <span class="org-haskell-operator">*&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.spaces
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pExpr2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pExpr2</span> <span class="org-haskell-operator">=</span> P.between (P.char <span class="org-string">'('</span>) (P.char <span class="org-string">')'</span>) p
    <span class="org-haskell-keyword">where</span>
      p <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
        P.spaces
        num <span class="org-haskell-operator">&lt;-</span> pNum
        P.spaces
        return num 
<span class="org-haskell-constructor">:</span>}


 <span class="org-haskell-operator">&gt;</span> run pExpr <span class="org-string">"( 100 )"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr <span class="org-string">"( 100 2100 )"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 7)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"2"</span>
<span class="org-haskell-definition">expecting</span> space or <span class="org-string">")"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr <span class="org-string">"(2023 )"</span>
2023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr <span class="org-string">"( 2023)"</span>
2023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr <span class="org-string">"( 2023)  "</span>
2023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr <span class="org-string">"( 2023)  asdasdas"</span>
2023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr2 <span class="org-string">"(2300)"</span>
2300
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pExpr2 <span class="org-string">"(  2300  )"</span>
2300
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
<b>Example 2 : Parse list of numbers between curly brackets.</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> read <span class="org-haskell-operator">&lt;$&gt;</span> P.many1 P.digit    
<span class="org-haskell-constructor">:</span>}  


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNumList</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-definition">pNumList</span> <span class="org-haskell-operator">=</span> P.between open close pList
    <span class="org-haskell-keyword">where</span>
      open <span class="org-haskell-operator">=</span> P.char <span class="org-string">'{'</span> <span class="org-haskell-operator">&gt;&gt;</span> P.spaces
      close <span class="org-haskell-operator">=</span> P.spaces <span class="org-haskell-operator">&gt;&gt;</span> P.char <span class="org-string">'}'</span>
      pList <span class="org-haskell-operator">=</span> P.sepBy (P.spaces <span class="org-haskell-operator">*&gt;</span> pNum <span class="org-haskell-operator">&lt;*</span> P.spaces) (P.char <span class="org-string">','</span>)        
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{100 , 200, 300, 400, 500}"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{100 , 200, 300, 400, 500  }"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{  100 , 200, 300, 400, 500  }"</span>
[100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{  100 }"</span>
[100]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{100}"</span>
[100]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{}"</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> <span class="org-string">"{"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNumList <span class="org-string">"{"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 2)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> white space, digit or <span class="org-string">"}"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li>
