haskell/Parsec_parser_combinators.org
**** TODO manyTill
**** TODO sepBy1 
**** eof 

Only suceeds at the end of input. (EOF - End Of File).

#+BEGIN_SRC haskell 
eof :: Parser ()
#+END_SRC

Example: 

#+BEGIN_SRC haskell 
:{
pNum :: Parser Int
pNum = fmap read $ P.many1 P.digit
:}   

> run pNum "9232"
9232
it :: ()

> run pNum "1023  "
1023
it :: ()
> 

> run pNum "9232-sadas"
9232
it :: ()

> run pNum ""
Parser Error
(line 1, column 1):
unexpected end of input
expecting digit
it :: ()

> run pNum " 3423 "
Parser Error
(line 1, column 1):
unexpected " "
expecting digit
it :: ()

> run pNum "23 3423 "
23
it :: ()
> 

> run (pNum <* P.eof) "100"
100
it :: ()
> run (pNum <* P.eof) "100 "
Parser Error
(line 1, column 4):
unexpected ' '
expecting digit or end of input
it :: ()
> run (pNum <* P.eof) "34asd"
Parser Error
(line 1, column 3):
unexpected 'a'
expecting digit or end of input
it :: ()
> 


#+END_SRC

** Examples - Complete Parsers 
