haskell/Parsec_parser_combinators.html

<li><a id="sec-1-2-2-11" name="sec-1-2-2-11"></a><span class="todo TODO">TODO</span> manyTill<br  /></li>
<li><a id="sec-1-2-2-12" name="sec-1-2-2-12"></a><span class="todo TODO">TODO</span> sepBy1<br  /></li>
<li><a id="sec-1-2-2-13" name="sec-1-2-2-13"></a>eof<br  /><div class="outline-text-5" id="text-1-2-2-13">
<p>
Only suceeds at the end of input. (EOF - End Of File).
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">eof</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-constructor">()</span>
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> fmap read <span class="org-haskell-operator">$</span> P.many1 P.digit
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">"9232"</span>
9232
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">"1023  "</span>
1023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">"9232-sadas"</span>
9232
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">""</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">" 3423 "</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">" "</span>
<span class="org-haskell-definition">expecting</span> digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pNum <span class="org-string">"23 3423 "</span>
23
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"100"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"100 "</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 4)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">' '</span>
<span class="org-haskell-definition">expecting</span> digit or end <span class="org-haskell-keyword">of</span> input
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pNum <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"34asd"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 3)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">'a'</span>
<span class="org-haskell-definition">expecting</span> digit or end <span class="org-haskell-keyword">of</span> input
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Examples - Complete Parsers</h3>
