haskell/Parsec_parser_combinators.html
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><a id="ID-56be5da0-fa7d-45b2-adc2-6040e5003582" name="ID-56be5da0-fa7d-45b2-adc2-6040e5003582"></a><span class="section-number-4">1.3.1</span> Parsing numbers</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>
Parse number with/without sign. 
</p>

<p>
File: numParser.hs 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XFlexibleContexts</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec.String</span> (<span class="org-haskell-constructor">Parser</span>)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec</span> ((<span class="org-haskell-operator">&lt;|&gt;</span>))
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">P</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec.Char</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">PC</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (void, forever)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Either</span> (isRight, isLeft)  

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">run</span> p str <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> P.parse p <span class="org-string">""</span> str <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Left</span> err  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Parser Error"</span>
                      print err
      <span class="org-haskell-constructor">Right</span> res <span class="org-haskell-operator">-&gt;</span> print res
<span class="org-haskell-constructor">:</span>} 


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pInt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pInt</span> <span class="org-haskell-operator">=</span> P.try pPos <span class="org-haskell-operator">&lt;|&gt;</span> pNeg
  <span class="org-haskell-keyword">where</span>

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse positive number</span>
    pPos <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
      s <span class="org-haskell-operator">&lt;-</span> P.many1 P.digit 
      return <span class="org-haskell-operator">$</span> read s

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse negative number </span>
    pNeg <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
      P.char <span class="org-string">'-'</span>
      n <span class="org-haskell-operator">&lt;-</span> pPos
      return (<span class="org-haskell-operator">-</span>n)
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-doc">-- | Parse float point numbers</span>
<span class="org-doc">-- |</span>
<span class="org-function-name">pFloat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-definition">pFloat</span> <span class="org-haskell-operator">=</span> pNan
   <span class="org-haskell-operator">&lt;|&gt;</span> P.try pInfPlus
   <span class="org-haskell-operator">&lt;|&gt;</span> P.try pInfNeg
   <span class="org-haskell-operator">&lt;|&gt;</span> P.try (read <span class="org-haskell-operator">&lt;$&gt;</span> pExp)
   <span class="org-haskell-operator">&lt;|&gt;</span> P.try (read <span class="org-haskell-operator">&lt;$&gt;</span> pDot)
   <span class="org-haskell-operator">&lt;|&gt;</span> P.try (read <span class="org-haskell-operator">&lt;$&gt;</span> pNDot)       
    <span class="org-haskell-keyword">where</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Float point constants </span>
    pNan     <span class="org-haskell-operator">=</span> P.string <span class="org-string">"nan"</span> <span class="org-haskell-operator">&gt;&gt;</span> return (read <span class="org-string">"NaN"</span>)
    pInfPlus <span class="org-haskell-operator">=</span> P.string <span class="org-string">"inf"</span> <span class="org-haskell-operator">&gt;&gt;</span> return (read <span class="org-string">"Infinity"</span>)
    pInfNeg  <span class="org-haskell-operator">=</span> P.string <span class="org-string">"-inf"</span> <span class="org-haskell-operator">&gt;&gt;</span> return (read <span class="org-string">"-Infinity"</span>)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse positive number</span>
    pPos <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
      s <span class="org-haskell-operator">&lt;-</span> P.many1 P.digit 
      return s

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse negative number </span>
    pNeg <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
      P.char <span class="org-string">'-'</span>
      s <span class="org-haskell-operator">&lt;-</span> pPos
      return <span class="org-haskell-operator">$</span> <span class="org-string">"-"</span> <span class="org-haskell-operator">++</span> s

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse number without dot like 200 or -435</span>
    pNDot <span class="org-haskell-operator">=</span> P.try pPos <span class="org-haskell-operator">&lt;|&gt;</span> pNeg

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse number with dot</span>
    pDot <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
      num1 <span class="org-haskell-operator">&lt;-</span> P.try pPos <span class="org-haskell-operator">&lt;|&gt;</span> pNeg
      P.char <span class="org-string">'.'</span>
      num2 <span class="org-haskell-operator">&lt;-</span> pPos
      return <span class="org-haskell-operator">$</span> num1 <span class="org-haskell-operator">++</span> <span class="org-string">"."</span> <span class="org-haskell-operator">++</span> num2

    <span class="org-comment-delimiter">-- </span><span class="org-comment">Parse number with format 10e3 20.23e5</span>
    pExp <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
      num1 <span class="org-haskell-operator">&lt;-</span> P.try pDot <span class="org-haskell-operator">&lt;|&gt;</span> pNDot
      P.oneOf <span class="org-string">"eE"</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">e or E</span>
      num2 <span class="org-haskell-operator">&lt;-</span> pNDot
      return <span class="org-haskell-operator">$</span> num1 <span class="org-haskell-operator">++</span> <span class="org-string">"E"</span> <span class="org-haskell-operator">++</span> num2

<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pInt <span class="org-string">"20023"</span>
20023
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pInt <span class="org-string">"-20023"</span>
<span class="org-haskell-operator">-</span>20023

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pInt <span class="org-string">"223 "</span>
223
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pInt <span class="org-string">"223 asa"</span>
223

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pInt <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"-223"</span>
<span class="org-haskell-operator">-</span>223
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pInt <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"223"</span>
223
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (pInt <span class="org-haskell-operator">&lt;*</span> P.eof) <span class="org-string">"223 "</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 4)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">' '</span>
<span class="org-haskell-definition">expecting</span> digit or end <span class="org-haskell-keyword">of</span> input
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> (run pFloat) [<span class="org-string">"inf"</span>, <span class="org-string">"nan"</span>, <span class="org-string">"-inf"</span>, <span class="org-string">"100"</span>, <span class="org-string">"0"</span>, <span class="org-string">"-0.0001"</span>, <span class="org-string">"1000e-2"</span>, <span class="org-string">"-100.23"</span>, <span class="org-string">"1e3"</span>, <span class="org-string">"1000"</span>, <span class="org-string">"-0.23e4"</span>]
<span class="org-haskell-constructor">Infinity</span>
<span class="org-haskell-constructor">NaN</span>
<span class="org-haskell-operator">-</span><span class="org-haskell-constructor">Infinity</span>
100.0
0.0
<span class="org-haskell-operator">-</span>1.0e-4
10.0
<span class="org-haskell-operator">-</span>100.23
1000.0
1000.0
<span class="org-haskell-operator">-</span>2300.0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
