haskell/Parsec_parser_combinators.html

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Simple Calculator</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec.String</span> (<span class="org-haskell-constructor">Parser</span>)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec</span> ((<span class="org-haskell-operator">&lt;|&gt;</span>))
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">P</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec.Char</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">PC</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (void, forever)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Either</span> (isRight, isLeft)


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pNum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pNum</span> <span class="org-haskell-operator">=</span> read <span class="org-haskell-operator">&lt;$&gt;</span> P.many1 P.digit    
<span class="org-haskell-constructor">:</span>} 

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pOperation</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Char</span> <span class="org-haskell-operator">-&gt;</span> (<span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>) <span class="org-haskell-operator">-&gt;</span>  <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span> 
<span class="org-haskell-definition">pOperation</span> op fn <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  numA <span class="org-haskell-operator">&lt;-</span> pNum
  P.spaces
  P.char op
  P.spaces
  numB <span class="org-haskell-operator">&lt;-</span> pNum
  return <span class="org-haskell-operator">$</span> fn numA numB
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">pAdd</span> <span class="org-haskell-operator">=</span> pOperation <span class="org-string">'+'</span> (<span class="org-haskell-operator">+</span>)
<span class="org-haskell-definition">pSub</span> <span class="org-haskell-operator">=</span> pOperation <span class="org-string">'-'</span> (<span class="org-haskell-operator">-</span>)
<span class="org-haskell-definition">pMul</span> <span class="org-haskell-operator">=</span> pOperation <span class="org-string">'*'</span> (<span class="org-haskell-operator">*</span>)
<span class="org-haskell-definition">pDiv</span> <span class="org-haskell-operator">=</span> pOperation <span class="org-string">'/'</span> div
<span class="org-haskell-definition">pRem</span> <span class="org-haskell-operator">=</span> pOperation <span class="org-string">'%'</span> rem       
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pCalc</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">pCalc</span> <span class="org-haskell-operator">=</span> P.choice [P.try pAdd
                 ,P.try pSub
                 ,P.try pMul
                 ,P.try pDiv
                 ,P.try pRem
                 ]         
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">runCalculator</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">runCalculator</span> <span class="org-haskell-operator">=</span>
    forever <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
      line <span class="org-haskell-operator">&lt;-</span> putStr <span class="org-string">"calc &gt; "</span> <span class="org-haskell-operator">&gt;&gt;</span> getLine
      run pCalc line
<span class="org-haskell-constructor">:</span>}
</pre>
</div>

<p>
Running:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pAdd <span class="org-string">"100 + 200"</span>
300
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pAdd <span class="org-string">"103+200"</span>
303
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pAdd <span class="org-string">"103+"</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 5)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> white space or digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"2010 / 10"</span>
201
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"100 % 432"</span>
100
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"203 - 126"</span>
77
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"203 + 126"</span>
329
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"203 * 126"</span>
25578
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"203 % 126"</span>
77
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pCalc <span class="org-string">"203 % "</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 7)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> space or digit
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> runCalculator <span class="org-comment-delimiter">-- </span><span class="org-comment">Run Ctrl + C to exit </span>
calc <span class="org-haskell-definition">&gt;</span> 100 <span class="org-haskell-operator">*</span> 20
2000
calc <span class="org-haskell-definition">&gt;</span> 89 <span class="org-haskell-operator">-</span> 100
<span class="org-haskell-operator">-</span>11
calc <span class="org-haskell-definition">&gt;</span> 2323  <span class="org-haskell-operator">^?</span>
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 7)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> <span class="org-string">"\DEL"</span>
<span class="org-haskell-definition">expecting</span> space, <span class="org-string">"+"</span>, <span class="org-string">"-"</span>, <span class="org-string">"*"</span>, <span class="org-string">"/"</span> or <span class="org-string">"%"</span>
calc <span class="org-haskell-definition">&gt;</span> 232 <span class="org-haskell-operator">/</span> 10
23
calc <span class="org-haskell-definition">&gt;</span> 35 <span class="org-haskell-operator">*</span> 9
315
calc <span class="org-haskell-definition">&gt;</span> 35 <span class="org-haskell-operator">*</span> 
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 6)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> space or digit
calc <span class="org-haskell-definition">&gt;</span> 
<span class="org-haskell-constructor">Parser</span> <span class="org-haskell-constructor">Error</span>
(line 1, column 1)<span class="org-haskell-constructor">:</span>
<span class="org-haskell-definition">unexpected</span> end <span class="org-haskell-keyword">of</span> input
<span class="org-haskell-definition">expecting</span> digit
calc <span class="org-haskell-definition">&gt;</span> <span class="org-haskell-operator">^</span>CInterrupted.
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
