haskell/Parsec_parser_combinators.html

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><a id="ID-bfd7926d-9dcd-46e6-a6f8-efbae7ad30a6" name="ID-bfd7926d-9dcd-46e6-a6f8-efbae7ad30a6"></a><span class="section-number-4">1.3.3</span> S-expression serialization</h4>
<div class="outline-text-4" id="text-1-3-3">

<p>
This example shows a s-expression parser that parses a simple
s-expression AST Abstract Syntax Tree. 
</p>

<p>
It was based on: 
</p>

<ul class="org-ul">
<li><a href="https://realworldocaml.org/v1/en/html/data-serialization-with-s-expressions.html">Chapter 17. Data Serialization with S-Expressions / Real World OCaml</a>
</li>

<li><a href="https://ocaml.janestreet.com/ocaml-core/111.28.00/doc/sexplib/#Sexp">OCaml Core - sexplib</a>
</li>

<li><a href="https://github.com/janestreet/sexplib">janestreet/sexplib: Automated S-expression conversion</a>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XFlexibleContexts</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec.String</span> (<span class="org-haskell-constructor">Parser</span>)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Parsec</span> ((<span class="org-haskell-operator">&lt;|&gt;</span>))
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">P</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Text.Parsec.Char</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">PC</span>

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (void)

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Either</span> (isRight, isLeft)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Text.Read</span> (readMaybe)

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Test.HUnit</span>     

<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span> (intercalate)

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sym</span>   <span class="org-haskell-constructor">String</span>
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Str</span>   <span class="org-haskell-constructor">String</span>
          <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sexp</span>]
          <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)
<span class="org-haskell-constructor">:</span>}



<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">apply</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> a
<span class="org-haskell-definition">apply</span> p s <span class="org-haskell-operator">=</span>  P.parse p <span class="org-string">""</span> s
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">applyOpt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-definition">applyOpt</span> p s <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">case</span> P.parse p <span class="org-string">""</span> s <span class="org-haskell-keyword">of</span>
               <span class="org-haskell-constructor">Left</span> <span class="org-haskell-keyword">_</span>  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nothing</span>
               <span class="org-haskell-constructor">Right</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Just</span> a
<span class="org-haskell-constructor">:</span>}                 


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">run</span> p str <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> P.parse p <span class="org-string">""</span> str <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Left</span> err  <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span> putStrLn <span class="org-string">"Parser Error"</span>
                      print err
      <span class="org-haskell-constructor">Right</span> res <span class="org-haskell-operator">-&gt;</span> print res
<span class="org-haskell-constructor">:</span>} 


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpToStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">sexpToStr</span> (<span class="org-haskell-constructor">Sym</span> s)   <span class="org-haskell-operator">=</span> s
<span class="org-haskell-definition">sexpToStr</span> (<span class="org-haskell-constructor">Str</span> s)   <span class="org-haskell-operator">=</span> <span class="org-string">"\""</span> <span class="org-haskell-operator">++</span> s <span class="org-haskell-operator">++</span> <span class="org-string">"\""</span>
<span class="org-haskell-definition">sexpToStr</span> (<span class="org-haskell-constructor">List</span> xs) <span class="org-haskell-operator">=</span> <span class="org-string">"( "</span> <span class="org-haskell-operator">++</span> (intercalate <span class="org-string">" "</span> <span class="org-haskell-operator">$</span> map sexpToStr xs) <span class="org-haskell-operator">++</span> <span class="org-string">" )"</span>
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">pStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span> 
<span class="org-haskell-definition">pStr</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  P.char <span class="org-string">'"'</span>
  s <span class="org-haskell-operator">&lt;-</span> P.manyTill P.anyChar (P.char <span class="org-string">'"'</span>)
  return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Str</span> s
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pSym</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span> 
<span class="org-haskell-definition">pSym</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sym</span> <span class="org-haskell-operator">&lt;$&gt;</span> P.many1 p
      <span class="org-haskell-keyword">where</span>
        pSym <span class="org-haskell-operator">=</span> P.oneOf <span class="org-string">"!$%&amp;|*+-/:&lt;=&gt;?@^_~"</span> 
        p <span class="org-haskell-operator">=</span> P.try P.letter <span class="org-haskell-operator">&lt;|&gt;</span> P.try P.digit <span class="org-haskell-operator">&lt;|&gt;</span> P.try pSym
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">pList</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-definition">pList</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  P.char <span class="org-string">'('</span>
  P.spaces
  slist <span class="org-haskell-operator">&lt;-</span> P.many (P.spaces <span class="org-haskell-operator">*&gt;</span> p <span class="org-haskell-operator">&lt;*</span> P.spaces)
  P.spaces          
  P.char <span class="org-string">')'</span>
  return <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">List</span> slist
      <span class="org-haskell-keyword">where</span>
        p <span class="org-haskell-operator">=</span> P.try pStr <span class="org-haskell-operator">&lt;|&gt;</span> P.try pSym <span class="org-haskell-operator">&lt;|&gt;</span> P.try pList
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">pSexp</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-definition">pSexp</span> <span class="org-haskell-operator">=</span> P.try pSym
    <span class="org-haskell-operator">&lt;|&gt;</span> P.try pStr
    <span class="org-haskell-operator">&lt;|&gt;</span> P.try pList
<span class="org-haskell-constructor">:</span>}        

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpOfStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Sexp</span>    
<span class="org-haskell-definition">sexpOfStr</span> <span class="org-haskell-operator">=</span> applyOpt pSexp
<span class="org-haskell-constructor">:</span>}

<span class="org-comment-delimiter">-- </span><span class="org-comment">Convert a list of values to s-expression.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpOfList</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-definition">sexpOfList</span> fn xs <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">List</span> <span class="org-haskell-operator">$</span> map fn xs               
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpOfValue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-definition">sexpOfValue</span> v <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sym</span> <span class="org-haskell-operator">$</span> show v
<span class="org-haskell-constructor">:</span>}  

<span class="org-comment-delimiter">-- </span><span class="org-comment">Tries to extract a list of values form a s-expression.</span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpToList</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> [a]
<span class="org-haskell-definition">sexpToList</span> fn (<span class="org-haskell-constructor">Sym</span> <span class="org-haskell-keyword">_</span>)   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">sexpToList</span> fn (<span class="org-haskell-constructor">Str</span> <span class="org-haskell-keyword">_</span>)   <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-definition">sexpToList</span> fn (<span class="org-haskell-constructor">List</span> xs) <span class="org-haskell-operator">=</span> sequence <span class="org-haskell-operator">$</span> map fn xs                    
<span class="org-haskell-constructor">:</span>}


<span class="org-comment-delimiter">-- </span><span class="org-comment">Try to extract a single value from a s-expression. </span>
<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">sexpToValue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Read</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-definition">sexpToValue</span> sp <span class="org-haskell-operator">=</span>
    <span class="org-haskell-keyword">case</span> sp <span class="org-haskell-keyword">of</span>
      <span class="org-haskell-constructor">Sym</span> s <span class="org-haskell-operator">-&gt;</span> readMaybe s
      <span class="org-haskell-keyword">_</span>     <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-definition">sexpToInt</span>    <span class="org-haskell-operator">=</span> sexpToValue <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">sexpToDouble</span> <span class="org-haskell-operator">=</span> sexpToValue <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Double</span>
<span class="org-haskell-type">:</span>}
</pre>
</div>

<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>script <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>sexpSerial<span class="org-haskell-operator">.</span>hs 
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sym</span> <span class="org-haskell-constructor">String</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Str</span> <span class="org-haskell-constructor">String</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sexp</span>]
<span class="org-function-name">apply</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Either</span> <span class="org-haskell-type">P.ParseError</span> a
<span class="org-function-name">applyOpt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-function-name">run</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Parser</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-function-name">sexpToStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="org-function-name">pStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">pSym</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">pList</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">pSexp</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Parser</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">sexpOfStr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">sexpOfList</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">sexpOfValue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span>
<span class="org-function-name">sexpToList</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> [a]
<span class="org-function-name">sexpToValue</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Read</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-function-name">sexpToDouble</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Double</span>
<span class="org-function-name">sexpToInt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> sexpToStr <span class="org-haskell-definition">$</span> <span class="org-haskell-type">List</span> [<span class="org-haskell-type">Sym</span> <span class="org-string">"100"</span>, <span class="org-haskell-type">Sym</span> <span class="org-string">"200"</span>, <span class="org-haskell-type">Sym</span> <span class="org-string">"300"</span>]
<span class="org-string">"( 100 200 300 )"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> sexpToStr <span class="org-haskell-definition">$</span> <span class="org-haskell-type">List</span> [<span class="org-haskell-type">Sym</span> <span class="org-string">"100"</span>, <span class="org-haskell-type">List</span> [ <span class="org-haskell-type">Sym</span> <span class="org-string">"200"</span>, <span class="org-haskell-type">Sym</span> <span class="org-string">"300"</span>], <span class="org-haskell-type">Str</span> <span class="org-string">"hello world"</span>, <span class="org-haskell-type">Sym</span> <span class="org-string">"x"</span>]
<span class="org-string">"( 100 ( 200 300 ) \"hello world\" x )"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSym <span class="org-string">"hello"</span>
<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSym <span class="org-string">"hello world"</span>
<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSym <span class="org-string">"3434hello world"</span>
<span class="org-haskell-constructor">Sym</span> <span class="org-string">"3434hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pQuotedStr <span class="org-string">"\"hello world haskell\""</span>
<span class="org-haskell-constructor">Str</span> <span class="org-string">"hello world haskell"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.spaces <span class="org-haskell-operator">&gt;&gt;</span> pQuotedStr) <span class="org-string">"  \"hello world haskell\""</span>
<span class="org-haskell-constructor">Str</span> <span class="org-string">"hello world haskell"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> (P.spaces <span class="org-haskell-operator">&gt;&gt;</span> pQuotedStr) <span class="org-string">"  \"hello\""</span>
<span class="org-haskell-constructor">Str</span> <span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pList <span class="org-string">"( 100 200 300)"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pList <span class="org-string">"( 100 200 300  )"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pList <span class="org-string">"( 100 200 300 hello world \"hello\" \"parsec is amazing\" )"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"world"</span>,<span class="org-haskell-constructor">Str</span> <span class="org-string">"hello"</span>,<span class="org-haskell-constructor">Str</span> <span class="org-string">"parsec is amazing"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pList <span class="org-string">"( 100 200 (300 hello world \"hello\") ()  \"parsec is amazing\" )"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"world"</span>,<span class="org-haskell-constructor">Str</span> <span class="org-string">"hello"</span>],<span class="org-haskell-constructor">List</span> <span class="org-haskell-constructor">[]</span>,<span class="org-haskell-constructor">Str</span> <span class="org-string">"parsec is amazing"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pList <span class="org-string">"(+ 100 200 300  )"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"+"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSexp <span class="org-string">"1232"</span>
<span class="org-haskell-constructor">Sym</span> <span class="org-string">"1232"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSexp <span class="org-string">"hello"</span>
<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSexp <span class="org-string">"(hello world)"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"world"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">run</span> pSexp <span class="org-string">"(++ hello world)"</span>
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"++"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"hello"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"world"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test1 <span class="org-haskell-operator">=</span> <span class="org-string">"( 100 200 300 400 500 )"</span>
<span class="org-function-name">test1</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test1 <span class="org-haskell-operator">=</span> <span class="org-string">"( 100 200 300 400 500 )"</span>
<span class="org-function-name">test1</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Char</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfStr</span> test1 
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"400"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"500"</span>])
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfStr</span> test1 <span class="org-haskell-operator">&gt;&gt;=</span> sexpToList sexpToInt 
<span class="org-haskell-constructor">Just</span> [100,200,300,400,500]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfStr</span> test1 <span class="org-haskell-operator">&gt;&gt;=</span> sexpToList sexpToDouble 
<span class="org-haskell-constructor">Just</span> [100.0,200.0,300.0,400.0,500.0]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Double</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfList</span> sexpOfValue [100, 200, 300, 5400]
<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"5400"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> test2 <span class="org-haskell-operator">=</span> sexpToStr <span class="org-haskell-operator">$</span> sexpOfList sexpOfValue [100, 200, 300, 5400]
<span class="org-function-name">test2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> test2
<span class="org-string">"( 100 200 300 5400 )"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfStr</span> test2
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">List</span> [<span class="org-haskell-constructor">Sym</span> <span class="org-string">"100"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"200"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"300"</span>,<span class="org-haskell-constructor">Sym</span> <span class="org-string">"5400"</span>])
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">Sexp</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sexpOfStr</span> test2 <span class="org-haskell-operator">&gt;&gt;=</span> sexpToList sexpToInt 
<span class="org-haskell-constructor">Just</span> [100,200,300,5400]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
