haskell/Parsec_parser_combinators.org
** References and Bookmarks 
 

 - Daan Leijen and Erik Meijer. *Parsec: Direct Style Monadic Parser
   Combinators. For The Real World*
   <https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/parsec-paper-letter.pdf>

 - Daan Leijen - *Parsec, a fast combinator parser* Accessed at
   2017-4-1. Available at
   <https://web.archive.org/web/20120401040711/http://legacy.cs.uu.nl/daan/download/parsec/parsec.pdf>

 - Aurick Qiao - *Applicative and Monadic Parsing Combinators* -
   <https://cs.uwaterloo.ca/~plragde/842/handouts/app-mon-qiao.pdf>

 - Parissa H.Sadeghi. *Monadic Parser
   Combinators*. <https://www.informatik.uni-kiel.de/~mh/lehre/seminare/ss04-sem-arbeiten/sadeghi.pdf> 

 - *Write Yourself a Scheme in 48 Hours.* An Introduction to Haskell
   through Example <https://upload.wikimedia.org/wikipedia/commons/a/aa/Write_Yourself_a_Scheme_in_48_Hours.pdf>

 - Yann Esposito. *Parsec Presentation* <http://yannesposito.com/Scratch/en/blog/Parsec-Presentation/>
 
 - [[https://wiki.haskell.org/Parsec][Parsec - HaskellWiki]]

 - [[https://github.com/JakeWheat/intro_to_parsing/][JakeWheat/intro_to_parsing: Introduction to parsing with Haskell and Parsec]]

 - *What's in a parser combinator?* - <https://remusao.github.io/whats-in-a-parser-combinator.html>

Misc 

 - [[http://stackoverflow.com/questions/tagged/parsec][Highest Voted 'parsec' Questions - Stack Overflow]] - Parsec in StackOverflow.

