haskell/Parsec_parser_combinators.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> References and Bookmarks</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Daan Leijen and Erik Meijer. <b>Parsec: Direct Style Monadic Parser
Combinators. For The Real World</b>
<a href="https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/parsec-paper-letter.pdf">https://www.microsoft.com/en-us/research/wp-content/uploads/2016/02/parsec-paper-letter.pdf</a>
</li>

<li>Daan Leijen - <b>Parsec, a fast combinator parser</b> Accessed at
2017-4-1. Available at
<a href="https://web.archive.org/web/20120401040711/http://legacy.cs.uu.nl/daan/download/parsec/parsec.pdf">https://web.archive.org/web/20120401040711/http://legacy.cs.uu.nl/daan/download/parsec/parsec.pdf</a>
</li>

<li>Aurick Qiao - <b>Applicative and Monadic Parsing Combinators</b> -
<a href="https://cs.uwaterloo.ca/~plragde/842/handouts/app-mon-qiao.pdf">https://cs.uwaterloo.ca/~plragde/842/handouts/app-mon-qiao.pdf</a>
</li>

<li>Parissa H.Sadeghi. <b>Monadic Parser
Combinators</b>. <a href="https://www.informatik.uni-kiel.de/~mh/lehre/seminare/ss04-sem-arbeiten/sadeghi.pdf">https://www.informatik.uni-kiel.de/~mh/lehre/seminare/ss04-sem-arbeiten/sadeghi.pdf</a> 
</li>

<li><b>Write Yourself a Scheme in 48 Hours.</b> An Introduction to Haskell
through Example <a href="https://upload.wikimedia.org/wikipedia/commons/a/aa/Write_Yourself_a_Scheme_in_48_Hours.pdf">https://upload.wikimedia.org/wikipedia/commons/a/aa/Write_Yourself_a_Scheme_in_48_Hours.pdf</a>
</li>

<li>Yann Esposito. <b>Parsec Presentation</b> <a href="http://yannesposito.com/Scratch/en/blog/Parsec-Presentation/">http://yannesposito.com/Scratch/en/blog/Parsec-Presentation/</a>
</li>

<li><a href="https://wiki.haskell.org/Parsec">Parsec - HaskellWiki</a>
</li>

<li><a href="https://github.com/JakeWheat/intro_to_parsing/">JakeWheat/intro_to_parsing: Introduction to parsing with Haskell and Parsec</a>
</li>

<li><b>What's in a parser combinator?</b> - <a href="https://remusao.github.io/whats-in-a-parser-combinator.html">https://remusao.github.io/whats-in-a-parser-combinator.html</a>
</li>
</ul>

<p>
Misc 
</p>

<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/tagged/parsec">Highest Voted 'parsec' Questions - Stack Overflow</a> - Parsec in StackOverflow.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues Soares Silva</p>
<p class="date">Created: 2018-05-07 Mon 10:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
